{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v1.2.9", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_33", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_31"}}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [4, 128]}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_14", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_15", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_72", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_73", "trainable": true, "dtype": "float32", "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": false}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_2/forward_lstm_14/lstm_cell_19/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"min": -1.7142576586966423, "scale": 0.014167418666914398, "dtype": "uint8"}}, {"name": "bidirectional_2/forward_lstm_14/lstm_cell_19/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -1.0262732882125705, "scale": 0.007834147238263896, "dtype": "uint8"}}, {"name": "bidirectional_2/forward_lstm_14/lstm_cell_19/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.4639153744660172, "scale": 0.006924110066656973, "dtype": "uint8"}}, {"name": "bidirectional_2/backward_lstm_14/lstm_cell_20/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"min": -2.0350098609924316, "scale": 0.015416741371154785, "dtype": "uint8"}}, {"name": "bidirectional_2/backward_lstm_14/lstm_cell_20/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -1.005077875361723, "scale": 0.008171364840339212, "dtype": "uint8"}}, {"name": "bidirectional_2/backward_lstm_14/lstm_cell_20/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.5418583028456744, "scale": 0.007422716477338005, "dtype": "uint8"}}, {"name": "bidirectional_3/forward_lstm_15/lstm_cell_22/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"min": -1.6629395316628848, "scale": 0.012050286461325253, "dtype": "uint8"}}, {"name": "bidirectional_3/forward_lstm_15/lstm_cell_22/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -0.7971248509837132, "scale": 0.0069315204433366365, "dtype": "uint8"}}, {"name": "bidirectional_3/forward_lstm_15/lstm_cell_22/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.3091881611767937, "scale": 0.005521217163871316, "dtype": "uint8"}}, {"name": "bidirectional_3/backward_lstm_15/lstm_cell_23/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"min": -1.2817818884756051, "scale": 0.010336950713512944, "dtype": "uint8"}}, {"name": "bidirectional_3/backward_lstm_15/lstm_cell_23/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -0.8188747560276705, "scale": 0.006712088164161233, "dtype": "uint8"}}, {"name": "bidirectional_3/backward_lstm_15/lstm_cell_23/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.38383838218801164, "scale": 0.0058157330634547215, "dtype": "uint8"}}, {"name": "dense_72/kernel", "shape": [128, 64], "dtype": "float32", "quantization": {"min": -0.7279082952761182, "scale": 0.005686783556844674, "dtype": "uint8"}}, {"name": "dense_72/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.38431558048023895, "scale": 0.003002465472501867, "dtype": "uint8"}}, {"name": "dense_73/kernel", "shape": [64, 6], "dtype": "float32", "quantization": {"min": -2.392073922998765, "scale": 0.011074416310179467, "dtype": "uint8"}}, {"name": "dense_73/bias", "shape": [6], "dtype": "float32", "quantization": {"min": -0.31375025662721373, "scale": 0.0016172693640578027, "dtype": "uint8"}}]}]}